Revit 2026 API

# AdvancedGlazingGlazingTransmissionRoughness Property

---

The property labeled "Transmissive roughness" from the "AdvancedGlazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GlazingTransmissionRoughness { get; }
```
```vb
Public Shared ReadOnly Property GlazingTransmissionRoughness As String
	Get
```
```cpp
public:
static property String^ GlazingTransmissionRoughness {
	String^ get ();
}
```
```fsharp
static member GlazingTransmissionRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace